Repository: nguyen-mai/FINAL
Catalog: code/PlantCare/PlantCare/Resources/Localization/*.lproj/Localizable.strings
Languages: vi

source: Vietnamese
vi: Tiếng Việt

source: English
vi: Tiếng Anh

source: Skip
vi: Bỏ qua

source: Next
vi: Tiếp theo

source: Get Started
vi: Bắt đầu

source: Identify Plant Diseases
vi: Nhận Diện Bệnh Cây Trồng

source: You can identify the plant diseases you don't know through your camera
vi: Nhận diện bệnh cây trồng bạn chưa biết thông qua máy ảnh

source: Discover Many Plant Diseases
vi: Khám Phá Nhiều Loại Bệnh Cây Trồng

source: Let's learn about the many plant diseases that exist in the world
vi: Khám phá thêm nhiều loại bệnh cây trồng tồn tại trên thế giới

source: Q&A About Plant Diseases
vi: Hỏi Đáp Về Bệnh Cây Trồng

source: Let's ask questions and answers with the community
vi: Đặt câu hỏi và trả lời với cộng đồng sử dụng ứng dụng

source: Back
vi: Trở lại

source: Take a picture
vi: Chụp ảnh

source: See diagnosis
vi: Chẩn đoán

source: Get medicine
vi: Lấy thuốc

source: Prediction
vi: Chẩn đoán

source: Symptom
vi: Triệu chứng

source: Conditions for disease development
vi: Điều kiện

source: Prevention and treatment
vi: Chữa trị

source: Certainty
vi: Dự đoán

source: Type
vi: Loại

source: Threat Level
vi: Mức độ nguy hiểm

source: Select a photo
vi: Lựa chọn ảnh

source: Photo
vi: Thư viện

source: Camera
vi: Máy ảnh

source: Cancel
vi: Huỷ

source: High
vi: Cao

source: Low
vi: Thấp

source: Medium
vi: Trung bình

source: Fungus
vi: Nấm

source: Healthy
vi: Khoẻ mạnh

source: Apple
vi: Cây táo

source: Apple Scab
vi: Bệnh ghẻ

source: On leaves, diseased spots are round, greenish-gray, slightly raised. The disease usually first appears on the underside of leaves, then spreads gradually. On the fruit, the disease is dark brown, raised like a scab and cracked, the fruit is distorted and falls prematurely.
vi: Trên lá đốm bệnh tròn, màu xám xanh, hơi gồ lên, bệnh thường xuất hiện đầu tiên ở mặt dưới lá, sau đó mới lan dần. Trên quả vết bệnh màu nâu đen, gồ lên như nốt ghẻ và nứt, quả méo mó và rụng sớm.

source: Black Rot
vi: Bệnh đốm đen

source: Corn Grey Leaf Spot
vi: Bệnh sọc lá cây ngô

source: Initially, the lesions are only as small as needles, yellowish in color, then gradually develop into round, oval or amorphous shapes, the color and size of the lesions change. The disease occurs in all parts of the maize plant: leaves, stems, corn but mainly on leaves. The disease can arise very early as soon as the corn plant has 2-3 leaves.
vi: Ban đầu vết bệnh chỉ nhỏ như đầu kim, có màu hơi vàng, sau phát triển dần thành hình tròn, bầu dục hoặc vô định hình, màu sắc và kích thước vết bệnh thay đổi. Bệnh xuất hiện ở tất cả các bộ phận của cây ngô: lá, thân. , ngô nhưng chủ yếu trên lá. Bệnh có thể phát sinh rất sớm ngay khi cây ngô được 2 - 3 lá.

source: The disease arises in humid climates, fungal spores form a lot, especially in the stem nodes, leaf blades, corn husks forming a brown or black hairy layer. Leaf spot disease often causes a lot of damage in bad corn fields are fields without intensive farming, making the plants stunted and ugly. In addition, bad soils, lowland or waterlogged soils, fields with heavy, tight meat texture, or fields with frequent water shortages... make maize plants grow poorly, stunted, and unable to develop.
vi: Bệnh phát sinh ở những nơi có khí hậu ẩm ướt, bào tử nấm hình thành nhiều, đặc biệt ở các đốt thân, phiến lá, vỏ ngô tạo thành một lớp lông màu nâu hoặc đen. Bệnh đốm lá thường gây hại nhiều ở những ruộng ngô xấu là những ruộng không thâm canh làm cho cây còi cọc, xấu xí. Ngoài ra, đất xấu, đất trũng hay úng nước, ruộng nặng, thịt chặt, ruộng thường xuyên thiếu nước ... làm cho cây ngô sinh trưởng kém, còi cọc, không phát triển được.

source: Corn should be planted in fields with light soil or sandy soil, with a good irrigation system, ensuring drainage in the rainy season and having enough water to actively irrigate corn in the dry season, creating growth for maize. and favorable development. Collect cleanly the remnants of diseased corn plants after harvest… Before planting, it is necessary to plow and harrow the field thoroughly to bury the remnants of diseased plants to kill the source of the disease spreading to the next crop. Care, fertilize and water properly to prevent diseases. When the field is sick, use one of the drugs such as: Tilt super 300EC; Daconil; Ridomil; Validacin; Mannozeb 80WP…for spraying. Before spraying, carefully read the instructions on how to use the drug printed on the packaging. If the field is often seriously damaged by diseases, it should be rotated with some other vegetables to limit and prevent diseases.
vi: Nên trồng ngô trên ruộng đất thịt nhẹ hoặc đất cát pha, có hệ thống tưới tiêu tốt, đảm bảo thoát nước trong mùa mưa và đủ nước để chủ động tưới cho ngô trong mùa khô, tạo sự sinh trưởng cho cây ngô. phát triển thuận lợi. n Thu gom sạch sẽ tàn dư cây ngô bị bệnh sau khi thu hoạch… Trước khi trồng phải cày, bừa kỹ ruộng để vùi xác những cây bệnh còn sót lại để diệt nguồn bệnh lây lan sang vụ sau. n Chăm sóc, bón phân, tưới nước hợp lý để phòng bệnh. n Khi ruộng bị bệnh sử dụng một trong các loại thuốc như: Tilt super 300EC; Daconil; Ridomil; Validacin; Mannozeb 80WP… để phun. Trước khi phun phải đọc kỹ hướng dẫn sử dụng thuốc in trên bao bì, nếu ruộng thường xuyên bị bệnh hại nặng thì nên luân canh với một số loại rau khác để hạn chế và phòng trừ bệnh.

source: Search...
vi: Tìm kiếm...

source: Yes
vi: Có

source: No
vi: Không

source: Is the result right?
vi: Thông tin này hữu ích không?
